src/Catalogs/МестаХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МестаХранения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыНедвижимости</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыМест</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Помещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шкаф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коробка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/МестаХранения/Ext/ObjectModule.bsl
// Место: помещение, зона, шкаф, полка внутри одного дома (METADATA §2.2).
// Дерево мест и принадлежность дому проверяет сервис Дома.

Перем ИзменилсяАрхив; // изменился ли признак «Архив» относительно базы

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипМеста.Пустая() Тогда
		ТипМеста = Перечисления.ТипыМест.Помещение;
	КонецЕсли;
	Если Владелец.Пустая() Тогда
		Владелец = Дома.ДомПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	ИзменилсяАрхив = Дома.ИзменилсяАрхив(Ссылка, Архив);
	Дома.ПроверитьМесто(ЭтотОбъект, Отказ);

КонецПроцедуры

// Признак «Архив» уходит вложенным местам, дальше по дереву — их событиями.
Процедура ПриЗаписи(Отказ)

	Если ИзменилсяАрхив И НЕ ОбменДанными.Загрузка Тогда
		Дома.ЗаписатьАрхивВложеннымМестам(Ссылка, Архив);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ПустаяСтрока(Наименование) Тогда
		Отказ = Истина;
		СообщитьПользователю(НСтр("ru = 'Укажите название — без него место не найти в поиске.'"),
			"Наименование");
	КонецЕсли;

	Если Владелец.Пустая() Тогда
		Отказ = Истина;
		СообщитьПользователю(НСтр("ru = 'Выберите дом, в котором находится место.'"),
			"Владелец");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьПользователю(Текст, Поле = "")

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти
